## Terraform Plan Output
<details><summary>Click to expand</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # azurerm_kubernetes_cluster.tf-aks will be updated in-place
  ~ resource "azurerm_kubernetes_cluster" "tf-aks" {
      ~ automatic_upgrade_channel           = "node-image" -> "patch"
        id                                  = "/subscriptions/456fb512-af18-4d07-861c-3ee54eae9181/resourceGroups/tf-aks-rg/providers/Microsoft.ContainerService/managedClusters/tf-aks-cluster"
      + image_cleaner_enabled               = true
      + image_cleaner_interval_hours        = 168
        name                                = "tf-aks-cluster"
      ~ tags                                = {
          - "Environment" = "Dev" -> null
          - "Owner"       = "kmiszel" -> null
          - "Source"      = "terraform" -> null
        }
        # (30 unchanged attributes hidden)

      ~ default_node_pool {
            name                          = "systempool"
            tags                          = {}
            # (30 unchanged attributes hidden)

          - upgrade_settings {
              - drain_timeout_in_minutes      = 0 -> null
              - max_surge                     = "10%" -> null
              - node_soak_duration_in_minutes = 0 -> null
            }
        }

        # (4 unchanged blocks hidden)
    }

  # azurerm_network_security_group.tf-aks_nsg will be created
  + resource "azurerm_network_security_group" "tf-aks_nsg" {
      + id                  = (known after apply)
      + location            = "northeurope"
      + name                = "tf-aks-nsg"
      + resource_group_name = "tf-aks-rg"
      + security_rule       = (known after apply)
    }

  # azurerm_subnet.tf-aks_subnet will be created
  + resource "azurerm_subnet" "tf-aks_subnet" {
      + address_prefixes                              = [
          + "10.224.0.0/16",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "tf-aks-subnet"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "tf-aks-rg"
      + virtual_network_name                          = "tf-aks-vnet"
    }

  # azurerm_subnet_network_security_group_association.tf-aks_nsg_assoc will be created
  + resource "azurerm_subnet_network_security_group_association" "tf-aks_nsg_assoc" {
      + id                        = (known after apply)
      + network_security_group_id = (known after apply)
      + subnet_id                 = (known after apply)
    }

  # azurerm_virtual_network.tf-aks_vnet will be created
  + resource "azurerm_virtual_network" "tf-aks_vnet" {
      + address_space       = [
          + "10.224.0.0/12",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "northeurope"
      + name                = "tf-aks-vnet"
      + resource_group_name = "tf-aks-rg"
      + subnet              = (known after apply)
    }

Plan: 4 to add, 1 to change, 0 to destroy.
```
</details>